/* Напишіть функцію, яка рекурсивно обчислює n-те число Фібоначчі.
 Числа Фібоначчі визначаються як послідовність, у якій кожне 
 число дорівнює сумі двох попередніх 
 чисел (наприклад, 0, 1, 1, 2, 3, 5, 8 і так далі).
  Використовуйте рекурсію для обчислення чисел Фібоначчі. */


  function fibonacci(n) {
    // Базові випадки
    if (n <= 0) return 0;
    if (n === 1) return 1;
    
    // Рекурсивний виклик
    return fibonacci(n - 1) + fibonacci(n - 2);
}

console.log(fibonacci(0));  // 0
console.log(fibonacci(1));  // 1
console.log(fibonacci(5));  // 5
console.log(fibonacci(10)); // 55