/* Вам необхідно написати функцію summarize(num), яка приймає на вхід число і повертає функцію, яка під час виклику додає це число до аргументу і повертає результат. Якщо аргумент не передано, то додається одиниця. Наприклад, якщо функція викликається з аргументом 5, то функція, що повертається, повинна при виклику з аргументом 3 повернути 8 (тому що 3 + 5 = 8) або 6, якщо аргумент не буде передано. */


function summarize(num) {
    return function(arg = 1) {
        return arg + num;
    }
}

const addArgument = summarize(6);
console.log(addArgument(4)); // Output: 10
console.log(addArgument()); // Output: 7
