/*Вам необхідно написати функцію findGCD(a, b), 
яка приймає на вхід два числа і повертає їхній НСД. */

function findGCD(a, b) {
    // Ініціалізуємо зміну temp, куди будемо зберігати тимчасове значення
    let temp;

    // Перевіряємо, чи друге число не дорівнює 0
    while (b !== 0) {
        // Зберігаємо друге число для подальшого використання
        temp = b;

        // Змінюємо друге число на залишок від ділення першого числа на друге
        b = a % b;

        // Перший стає другим, і тимчасове значення - першим
        a = temp;
    }

    // Повертаємо НСД, яке зберіглося в першому числі
    return a;
}

const num1 = 24;
const num2 = 36;

// Викликаємо функцію з нашими числами
const gcd = findGCD(num1, num2);

console.log(`Найбільший спільний дільник чисел  ${num1} та ${num2} є : ${gcd}`);